In [1]:
import pandas as pd
import numpy as np
pd.set_option('display.float_format', lambda x: '%.3f' % x)

In [2]:
df = pd.read_csv('http://web.mta.info/developers/data/nyct/turnstile/turnstile_190518.txt')

In [3]:
df.columns = df.columns.str.strip()

Getting the day of the week column

In [4]:
df['DATETIME'] = df['DATE'] + ' ' + df['TIME']
df['DATETIME'] = pd.to_datetime(df['DATETIME'], format = '%m/%d/%Y %H:%M:%S')

In [5]:
df.head()

,C/A,UNIT,SCP,STATION,LINENAME,DIVISION,DATE,TIME,DESC,ENTRIES,EXITS,DATETIME
0,A002,R051,02-00-00,59 ST,NQR456W,BMT,05/11/2019,00:00:00,REGULAR,7053483,2390505,2019-05-11 00:00:00
1,A002,R051,02-00-00,59 ST,NQR456W,BMT,05/11/2019,04:00:00,REGULAR,7053511,2390508,2019-05-11 04:00:00
2,A002,R051,02-00-00,59 ST,NQR456W,BMT,05/11/2019,08:00:00,REGULAR,7053534,2390536,2019-05-11 08:00:00
3,A002,R051,02-00-00,59 ST,NQR456W,BMT,05/11/2019,12:00:00,REGULAR,7053618,2390596,2019-05-11 12:00:00
4,A002,R051,02-00-00,59 ST,NQR456W,BMT,05/11/2019,16:00:00,REGULAR,7053841,2390655,2019-05-11 16:00:00

In [6]:
df['DAY'] = df['DATETIME'].dt.day_name()

In [7]:
df.head()

,C/A,UNIT,SCP,STATION,LINENAME,DIVISION,DATE,TIME,DESC,ENTRIES,EXITS,DATETIME,DAY
0,A002,R051,02-00-00,59 ST,NQR456W,BMT,05/11/2019,00:00:00,REGULAR,7053483,2390505,2019-05-11 00:00:00,Saturday
1,A002,R051,02-00-00,59 ST,NQR456W,BMT,05/11/2019,04:00:00,REGULAR,7053511,2390508,2019-05-11 04:00:00,Saturday
2,A002,R051,02-00-00,59 ST,NQR456W,BMT,05/11/2019,08:00:00,REGULAR,7053534,2390536,2019-05-11 08:00:00,Saturday
3,A002,R051,02-00-00,59 ST,NQR456W,BMT,05/11/2019,12:00:00,REGULAR,7053618,2390596,2019-05-11 12:00:00,Saturday
4,A002,R051,02-00-00,59 ST,NQR456W,BMT,05/11/2019,16:00:00,REGULAR,7053841,2390655,2019-05-11 16:00:00,Saturday

Get each every exit and entry delta

In [8]:
df['ENTRY_DELTA'] = df.groupby(['UNIT', 'SCP'])['ENTRIES'].transform(lambda x: x.diff())
df['EXIT_DELTA'] = df.groupby(['UNIT', 'SCP'])['EXITS'].transform(lambda x: x.diff())

In [9]:
df.head()

,C/A,UNIT,SCP,STATION,LINENAME,DIVISION,DATE,TIME,DESC,ENTRIES,EXITS,DATETIME,DAY,ENTRY_DELTA,EXIT_DELTA
0,A002,R051,02-00-00,59 ST,NQR456W,BMT,05/11/2019,00:00:00,REGULAR,7053483,2390505,2019-05-11 00:00:00,Saturday,nan,nan
1,A002,R051,02-00-00,59 ST,NQR456W,BMT,05/11/2019,04:00:00,REGULAR,7053511,2390508,2019-05-11 04:00:00,Saturday,28.000,3.000
2,A002,R051,02-00-00,59 ST,NQR456W,BMT,05/11/2019,08:00:00,REGULAR,7053534,2390536,2019-05-11 08:00:00,Saturday,23.000,28.000
3,A002,R051,02-00-00,59 ST,NQR456W,BMT,05/11/2019,12:00:00,REGULAR,7053618,2390596,2019-05-11 12:00:00,Saturday,84.000,60.000
4,A002,R051,02-00-00,59 ST,NQR456W,BMT,05/11/2019,16:00:00,REGULAR,7053841,2390655,2019-05-11 16:00:00,Saturday,223.000,59.000

Eliminate Outliers

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 208681 entries, 0 to 208680
Data columns (total 15 columns):
C/A            208681 non-null object
UNIT           208681 non-null object
SCP            208681 non-null object
STATION        208681 non-null object
LINENAME       208681 non-null object
DIVISION       208681 non-null object
DATE           208681 non-null object
TIME           208681 non-null object
DESC           208681 non-null object
ENTRIES        208681 non-null int64
EXITS          208681 non-null int64
DATETIME       208681 non-null datetime64[ns]
DAY            208681 non-null object
ENTRY_DELTA    203829 non-null float64
EXIT_DELTA     203829 non-null float64
dtypes: datetime64[ns](1), float64(2), int64(2), object(10)
memory usage: 23.9+ MB

In [11]:
df = df[df['ENTRY_DELTA'] >= 0]
df = df[df['EXIT_DELTA'] >= 0]

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 201377 entries, 1 to 208680
Data columns (total 15 columns):
C/A            201377 non-null object
UNIT           201377 non-null object
SCP            201377 non-null object
STATION        201377 non-null object
LINENAME       201377 non-null object
DIVISION       201377 non-null object
DATE           201377 non-null object
TIME           201377 non-null object
DESC           201377 non-null object
ENTRIES        201377 non-null int64
EXITS          201377 non-null int64
DATETIME       201377 non-null datetime64[ns]
DAY            201377 non-null object
ENTRY_DELTA    201377 non-null float64
EXIT_DELTA     201377 non-null float64
dtypes: datetime64[ns](1), float64(2), int64(2), object(10)
memory usage: 24.6+ MB

Dropped about 3.5% of the data

In [13]:
df.describe()

             ENTRIES          EXITS    ENTRY_DELTA    EXIT_DELTA
count     201377.000     201377.000     201377.000    201377.000
mean    28409445.757   20884766.486      14868.041      2601.821
std    159945204.726  137761910.402    5002549.402    799887.465
min            0.000          0.000          0.000         0.000
25%       332169.000     139050.000          9.000         8.000
50%      2065931.000    1208140.000         69.000        51.000
75%      6464181.000    4418950.000        237.000       165.000
max   2115830563.000 2062389317.000 2055525511.000 317577546.000

In [14]:
df = df[df['ENTRY_DELTA'] < 15000]
df = df[df['EXIT_DELTA'] < 15000]

In [15]:
df.describe()

             ENTRIES          EXITS  ENTRY_DELTA  EXIT_DELTA
count     201367.000     201367.000   201367.000  201367.000
mean    28396012.490   20883277.698      173.043     136.300
std    159872812.511  137763291.660      254.645     231.633
min            0.000          0.000        0.000       0.000
25%       332181.500     139050.000        9.000       8.000
50%      2065955.000    1208144.000       69.000      51.000
75%      6463803.500    4418906.500      237.000     165.000
max   2115830563.000 2062389317.000     3946.000    5406.000

that was only ten entries

In [16]:
df.head()

,C/A,UNIT,SCP,STATION,LINENAME,DIVISION,DATE,TIME,DESC,ENTRIES,EXITS,DATETIME,DAY,ENTRY_DELTA,EXIT_DELTA
1,A002,R051,02-00-00,59 ST,NQR456W,BMT,05/11/2019,04:00:00,REGULAR,7053511,2390508,2019-05-11 04:00:00,Saturday,28.000,3.000
2,A002,R051,02-00-00,59 ST,NQR456W,BMT,05/11/2019,08:00:00,REGULAR,7053534,2390536,2019-05-11 08:00:00,Saturday,23.000,28.000
3,A002,R051,02-00-00,59 ST,NQR456W,BMT,05/11/2019,12:00:00,REGULAR,7053618,2390596,2019-05-11 12:00:00,Saturday,84.000,60.000
4,A002,R051,02-00-00,59 ST,NQR456W,BMT,05/11/2019,16:00:00,REGULAR,7053841,2390655,2019-05-11 16:00:00,Saturday,223.000,59.000
5,A002,R051,02-00-00,59 ST,NQR456W,BMT,05/11/2019,20:00:00,REGULAR,7054133,2390702,2019-05-11 20:00:00,Saturday,292.000,47.000

In [17]:
df.describe()

             ENTRIES          EXITS  ENTRY_DELTA  EXIT_DELTA
count     201367.000     201367.000   201367.000  201367.000
mean    28396012.490   20883277.698      173.043     136.300
std    159872812.511  137763291.660      254.645     231.633
min            0.000          0.000        0.000       0.000
25%       332181.500     139050.000        9.000       8.000
50%      2065955.000    1208144.000       69.000      51.000
75%      6463803.500    4418906.500      237.000     165.000
max   2115830563.000 2062389317.000     3946.000    5406.000

get daily traffic figures: going to try to add entry and exit data to get total people entering and exiting on any given day

In [18]:
daily_entries = df.groupby(['STATION', 'LINENAME','DAY']).agg({'ENTRY_DELTA' : 'sum'})

In [19]:
daily_entries.head()

                           ENTRY_DELTA
STATION LINENAME DAY
1 AV    L        Friday      19409.000
                 Monday      16976.000
                 Saturday     5581.000
                 Sunday       4770.000
                 Thursday    19686.000

In [20]:
daily_exits = df.groupby(['STATION', 'LINENAME','DAY']).agg({'EXIT_DELTA' : 'sum'})

Making separate dataframes for only weekends and weekdays

In [21]:
weekends = df[(df.DAY == "Saturday") | (df.DAY == "Sunday")]

In [22]:
weekends.head()

,C/A,UNIT,SCP,STATION,LINENAME,DIVISION,DATE,TIME,DESC,ENTRIES,EXITS,DATETIME,DAY,ENTRY_DELTA,EXIT_DELTA
1,A002,R051,02-00-00,59 ST,NQR456W,BMT,05/11/2019,04:00:00,REGULAR,7053511,2390508,2019-05-11 04:00:00,Saturday,28.000,3.000
2,A002,R051,02-00-00,59 ST,NQR456W,BMT,05/11/2019,08:00:00,REGULAR,7053534,2390536,2019-05-11 08:00:00,Saturday,23.000,28.000
3,A002,R051,02-00-00,59 ST,NQR456W,BMT,05/11/2019,12:00:00,REGULAR,7053618,2390596,2019-05-11 12:00:00,Saturday,84.000,60.000
4,A002,R051,02-00-00,59 ST,NQR456W,BMT,05/11/2019,16:00:00,REGULAR,7053841,2390655,2019-05-11 16:00:00,Saturday,223.000,59.000
5,A002,R051,02-00-00,59 ST,NQR456W,BMT,05/11/2019,20:00:00,REGULAR,7054133,2390702,2019-05-11 20:00:00,Saturday,292.000,47.000

In [23]:
weekdays = df[(df.DAY != "Saturday") & (df.DAY != "Sunday")]

In [24]:
weekdays.head()

,C/A,UNIT,SCP,STATION,LINENAME,DIVISION,DATE,TIME,DESC,ENTRIES,EXITS,DATETIME,DAY,ENTRY_DELTA,EXIT_DELTA
12,A002,R051,02-00-00,59 ST,NQR456W,BMT,05/13/2019,00:00:00,REGULAR,7054748,2390918,2019-05-13 00:00:00,Monday,79.000,21.000
13,A002,R051,02-00-00,59 ST,NQR456W,BMT,05/13/2019,04:00:00,REGULAR,7054758,2390920,2019-05-13 04:00:00,Monday,10.000,2.000
14,A002,R051,02-00-00,59 ST,NQR456W,BMT,05/13/2019,08:00:00,REGULAR,7054791,2391016,2019-05-13 08:00:00,Monday,33.000,96.000
15,A002,R051,02-00-00,59 ST,NQR456W,BMT,05/13/2019,08:30:55,REGULAR,7054815,2391066,2019-05-13 08:30:55,Monday,24.000,50.000
16,A002,R051,02-00-00,59 ST,NQR456W,BMT,05/13/2019,12:00:00,REGULAR,7054967,2391242,2019-05-13 12:00:00,Monday,152.000,176.000

In [25]:
weekday_average = weekdays.groupby(['STATION', 'LINENAME']).agg({'ENTRY_DELTA' : 'sum'})

In [26]:
weekday_average.head()

                        ENTRY_DELTA
STATION       LINENAME
1 AV          L           94483.000
103 ST        1           57484.000
              6           70313.000
              BC          25846.000
103 ST-CORONA 7          102216.000

In [27]:
weekday_average['ENTRY_DELTA'] = weekday_average['ENTRY_DELTA']/5

In [28]:
weekday_average.head()

                        ENTRY_DELTA
STATION       LINENAME
1 AV          L           18896.600
103 ST        1           11496.800
              6           14062.600
              BC           5169.200
103 ST-CORONA 7           20443.200

In [29]:
weekend_average = weekends.groupby(['STATION', 'LINENAME']).agg({'ENTRY_DELTA' : 'sum'})

In [30]:
weekend_average['ENTRY_DELTA'] = weekend_average['ENTRY_DELTA']/2

In [31]:
weekend_average.head()

                        ENTRY_DELTA
STATION       LINENAME
1 AV          L            5175.500
103 ST        1            7803.000
              6            5492.000
              BC           2521.000
103 ST-CORONA 7           11792.500

In [32]:
weekend_average.reset_index()

             STATION      LINENAME  ENTRY_DELTA
0               1 AV             L     5175.500
1             103 ST             1     7803.000
2             103 ST             6     5492.000
3             103 ST            BC     2521.000
4      103 ST-CORONA             7    11792.500
5             104 ST             A      621.000
6             104 ST            JZ        9.500
7             110 ST             6     5013.500
8             111 ST             7     7282.500
9             111 ST             A      943.500
10            116 ST            23     6906.000
11            116 ST             6     7670.500
12            116 ST            BC     4002.000
13   116 ST-COLUMBIA             1     5980.500
14            121 ST            JZ       27.000
15            125 ST             1     4612.000
16            125 ST            23     8144.000
17            125 ST           456    11159.500
18            125 ST          ACBD    15848.000
19            135 ST            23     7928.000
20            135 ST            BC     2461.000
21   137 ST CITY COL             1     7251.500
22    138/GRAND CONC            45     1643.000
23             14 ST        123FLM    12702.500
24             14 ST          ACEL     9613.000
25             14 ST        FLM123     8180.500
26    14 ST-UNION SQ      456LNQRW    18926.500
27    14 ST-UNION SQ      LNQR456W    34427.000
28            145 ST             1     6101.500
29            145 ST             3     1764.000
..               ...           ...          ...
446   TIMES SQ-42 ST  1237ACENQRSW    33678.500
447   TIMES SQ-42 ST  ACENQRS1237W     3804.000
448    TOMPKINSVILLE             1      347.500
449       TREMONT AV            BD     5499.000
450  TWENTY THIRD ST             1     2986.000
451         UNION ST             R     3003.000
452         UTICA AV            AC     9330.000
453   V.CORTLANDT PK             1     3299.500
454    VAN SICLEN AV             3     1313.500
455    VAN SICLEN AV            JZ        7.500
456   VAN SICLEN AVE             C     1677.500
457   VERNON-JACKSON             7     7529.500
458   W 4 ST-WASH SQ       ABCDEFM    26453.000
459  W 8 ST-AQUARIUM            FQ     1442.500
460    WAKEFIELD/241             2     2525.000
461          WALL ST            23     5959.000
462          WALL ST            45     4854.000
463    WEST FARMS SQ            25     3584.500
464   WESTCHESTER SQ             6     2234.000
465  WHITEHALL S-FRY           R1W     6042.000
466      WHITLOCK AV             6      819.500
467        WILSON AV             L     2200.000
468      WINTHROP ST            25     2478.500
469   WOODHAVEN BLVD            JZ       36.000
470   WOODHAVEN BLVD            MR    11334.000
471         WOODLAWN             4     3346.500
472  WORLD TRADE CTR         ACE23     5489.000
473    WTC-CORTLANDT             1     5553.500
474          YORK ST             F     5589.000
475        ZEREGA AV             6     1096.000

[476 rows x 3 columns]

In [33]:
weekday_average.reset_index()

             STATION      LINENAME  ENTRY_DELTA
0               1 AV             L    18896.600
1             103 ST             1    11496.800
2             103 ST             6    14062.600
3             103 ST            BC     5169.200
4      103 ST-CORONA             7    20443.200
5             104 ST             A     1592.400
6             104 ST            JZ     2292.400
7             110 ST             6    11168.600
8             111 ST             7    11506.600
9             111 ST             A     2804.400
10            116 ST            23    11534.400
11            116 ST             6    15289.800
12            116 ST            BC     7908.400
13   116 ST-COLUMBIA             1    12849.000
14            121 ST            JZ     2698.600
15            125 ST             1     7329.400
16            125 ST            23    13405.400
17            125 ST           456    24573.000
18            125 ST          ACBD    29982.400
19            135 ST            23    14558.200
20            135 ST            BC     6031.600
21   137 ST CITY COL             1    12127.800
22    138/GRAND CONC            45     3624.400
23             14 ST        123FLM    21364.600
24             14 ST          ACEL    21031.200
25             14 ST        FLM123    18574.600
26    14 ST-UNION SQ      456LNQRW    31967.200
27    14 ST-UNION SQ      LNQR456W    72585.400
28            145 ST             1    10853.000
29            145 ST             3     3548.400
..               ...           ...          ...
446   TIMES SQ-42 ST  1237ACENQRSW    66043.400
447   TIMES SQ-42 ST  ACENQRS1237W    16694.600
448    TOMPKINSVILLE             1      830.200
449       TREMONT AV            BD    10357.400
450  TWENTY THIRD ST             1     9783.600
451         UNION ST             R     7619.600
452         UTICA AV            AC    17153.000
453   V.CORTLANDT PK             1     7640.000
454    VAN SICLEN AV             3     3039.400
455    VAN SICLEN AV            JZ     2716.600
456   VAN SICLEN AVE             C     3120.000
457   VERNON-JACKSON             7    15964.400
458   W 4 ST-WASH SQ       ABCDEFM    43209.800
459  W 8 ST-AQUARIUM            FQ     2276.800
460    WAKEFIELD/241             2     4904.600
461          WALL ST            23    26033.800
462          WALL ST            45    20275.000
463    WEST FARMS SQ            25     7148.200
464   WESTCHESTER SQ             6     6280.600
465  WHITEHALL S-FRY           R1W    19507.200
466      WHITLOCK AV             6     2015.200
467        WILSON AV             L     4245.200
468      WINTHROP ST            25     6782.200
469   WOODHAVEN BLVD            JZ     4725.400
470   WOODHAVEN BLVD            MR    20909.800
471         WOODLAWN             4     7126.400
472  WORLD TRADE CTR         ACE23    19436.800
473    WTC-CORTLANDT             1    13606.400
474          YORK ST             F    13934.200
475        ZEREGA AV             6     2672.600

[476 rows x 3 columns]

Grabbing the top ten station from Abi's analysis

In [41]:
top_weekdays = weekday_average.loc[['GRD CNTRL-42 ST','34 ST-HERALD SQ','34 ST-PENN STA','42 ST-PORT AUTH','14 ST-UNION SQ',
                                   'TIMES SQ-42 ST','59 ST COLUMBUS','FULTON ST','FLUSHING-MAIN','PATH NEW WTC']]

In [43]:
top_weekdays.head(50)

                              ENTRY_DELTA
STATION         LINENAME
14 ST-UNION SQ  456LNQRW        31967.200
                LNQR456W        72585.400
34 ST-HERALD SQ BDFMNQRW       119203.600
34 ST-PENN STA  123             37320.600
                123ACE          50635.800
                ACE             87790.200
42 ST-PORT AUTH ACENGRS1237W    13903.200
                ACENQRS1237W    79962.200
59 ST COLUMBUS  1ABCD           15222.200
                ABCD1           59822.600
FLUSHING-MAIN   7               58652.400
FULTON ST       2345ACJZ        65941.000
                ACJZ2345        31397.600
                G                5962.800
GRD CNTRL-42 ST 4567S          161473.800
PATH NEW WTC    1               59408.400
TIMES SQ-42 ST  1237ACENQRS     16940.400
                1237ACENQRSW    66043.400
                ACENQRS1237W    16694.600

In [44]:
top_weekdend = weekend_average.loc[['GRD CNTRL-42 ST','34 ST-HERALD SQ','34 ST-PENN STA','42 ST-PORT AUTH','14 ST-UNION SQ',
                                   'TIMES SQ-42 ST','59 ST COLUMBUS','FULTON ST','FLUSHING-MAIN','PATH NEW WTC']]

Turns out there are multiple stations with the same name... but looking at the line information, it really looks like
it's one station and the lines information is garbled.